Revit 2027 API
PropertyLine.SetPropertyTable Method
 Sets the table entries for a table-based PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPropertyTable(
	IList<PropertyTableEntry> newTable
)
Public Sub SetPropertyTable (
	newTable As IList(Of PropertyTableEntry)
)
public:
void SetPropertyTable(
	IList<PropertyTableEntry^>^ newTable
)
member SetPropertyTable :
        newTable : IList<PropertyTableEntry> -> unit
Parameters
newTable IList<PropertyTableEntry>
 Input property table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  PropertyLine is not table-based. -or- Failed to set property table for the property line element if it is sketch-based.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace